var provider = {
	letters: 'йцукенгшщзхъфывапролджэячсмитьбюЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ',

	words_list: ['eсли', 'возникает', 'а', 'боль', 'бы', 'было', 'вами', 'великие', 'возжаждал', 'возлюбил', 'возникает', 'возникают', 'воспользоваться', 'восхваляющих', 'всю', 'вы', 'говорил', 'действительно', 'если', 'жизни', 'за', 'заниматься', 'зодчим', 'и', 'из', 'из-за', 'избегает', 'избегал', 'или', 'именно', 'иной', 'истину', 'как', 'какими', 'картину', 'когда', 'которого', 'которое', 'кто', 'лишь', 'людей', 'мог', 'назвал', 'нас', 'наслаждение', 'наслаждений', 'наслаждению', 'наслаждения', 'не', 'некое', 'некоей', 'немалое', 'неприятностей', 'несло', 'нет', 'ни', 'никаких', 'никакого', 'никого', 'никто', 'но', 'обстоятельства', 'отвергает', 'открывший', 'откуда', 'перед', 'по', 'пользы', 'поняли', 'порицающих', 'постигают', 'потому', 'превратное', 'предаваться', 'предпочел', 'представление', 'презирает', 'примером', 'приносило', 'приносят', 'простейшим', 'равно', 'раз', 'разумно', 'разъясню', 'раскрою', 'с', 'само', 'собой', 'справедливости', 'стал', 'страдание', 'страдания', 'стремящегося', 'счастливой', 'такие', 'такого', 'тех', 'то', 'того', 'только', 'тягостными', 'умеет', 'упражнениями', 'упрекнуть', 'физическими', 'человек', 'что', 'чтобы', 'это', 'этот', 'я' ]
};

module.exports = provider;
